MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_DMA_TRIG_RX_RIS Bits */
/* UNICOMMUART_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RTOUT_OFS    (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RTOUT_MASK   ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RTOUT_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RTOUT_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMUART_DMA_TRIG_RX_RIS[RXINT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RXINT_OFS    (10)                            /* !< RXINT Offset */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RXINT_MASK   ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RXINT_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_DMA_TRIG_RX_RIS_RXINT_SET    ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* UNICOMMUART_DMA_TRIG_RX_MIS Bits */
/* UNICOMMUART_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RTOUT_OFS    (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RTOUT_MASK   ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RTOUT_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RTOUT_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMUART_DMA_TRIG_RX_MIS[RXINT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RXINT_OFS    (10)                            /* !< RXINT Offset */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RXINT_MASK   ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RXINT_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_DMA_TRIG_RX_MIS_RXINT_SET    ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* UNICOMMUART_DMA_TRIG_RX_ISET Bits */
/* UNICOMMUART_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RTOUT_OFS   (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RTOUT_MASK  ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RTOUT_SET   ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* UNICOMMUART_DMA_TRIG_RX_ISET[RXINT] Bits */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RXINT_OFS   (10)                            /* !< RXINT Offset */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RXINT_MASK  ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_DMA_TRIG_RX_ISET_RXINT_SET   ((uint32_t)0x00000400U)         /* !< Set Interrupt */

/* UNICOMMUART_IIDX Bits */
/* UNICOMMUART_IIDX[STAT] Bits */
#define UNICOMMUART_IIDX_STAT_OFS                (0)                             /* !< STAT Offset */
#define UNICOMMUART_IIDX_STAT_MASK               ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define UNICOMMUART_IIDX_STAT_NO_INTR            ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UNICOMMUART_IIDX_STAT_RTFG               ((uint32_t)0x00000001U)         /* !< UART receive time-out interrupt;
                                                                                    Interrupt Flag: RT; Interrupt
                                                                                    Priority: Highest */
#define UNICOMMUART_IIDX_STAT_FEFG               ((uint32_t)0x00000002U)         /* !< UART framing error interrupt;
                                                                                    Interrupt Flag: FE */
#define UNICOMMUART_IIDX_STAT_PEFG               ((uint32_t)0x00000003U)         /* !< UART parity error interrupt;
                                                                                    Interrupt Flag: PE */
#define UNICOMMUART_IIDX_STAT_BEFG               ((uint32_t)0x00000004U)         /* !< UART break error interrupt;
                                                                                    Interrupt Flag: BE */
#define UNICOMMUART_IIDX_STAT_OEFG               ((uint32_t)0x00000005U)         /* !< UART receive overrun error
                                                                                    interrupt; Interrupt Flag: OE */
#define UNICOMMUART_IIDX_STAT_RXNE               ((uint32_t)0x00000006U)         /* !< Negative edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXNE */
#define UNICOMMUART_IIDX_STAT_RXPE               ((uint32_t)0x00000007U)         /* !< Positive edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXPE */
#define UNICOMMUART_IIDX_STAT_LINC0              ((uint32_t)0x00000008U)         /* !< LIN capture 0 / match interrupt;
                                                                                    Interrupt Flag: LINC0 */
#define UNICOMMUART_IIDX_STAT_LINC1              ((uint32_t)0x00000009U)         /* !< LIN capture 1 interrupt; Interrupt
                                                                                    Flag: LINC1 */
#define UNICOMMUART_IIDX_STAT_LINOVF             ((uint32_t)0x0000000AU)         /* !< LIN hardware counter overflow
                                                                                    interrupt; Interrupt Flag: LINOVF */
#define UNICOMMUART_IIDX_STAT_RXIFG              ((uint32_t)0x0000000BU)         /* !< UART receive interrupt; Interrupt
                                                                                    Flag: RX */
#define UNICOMMUART_IIDX_STAT_TXIFG              ((uint32_t)0x0000000CU)         /* !< UART transmit interrupt; Interrupt
                                                                                    Flag: TX */
#define UNICOMMUART_IIDX_STAT_EOT                ((uint32_t)0x0000000DU)         /* !< UART end of transmission interrupt
                                                                                    (transmit serializer empty);
                                                                                    Interrupt Flag: EOT */
#define UNICOMMUART_IIDX_STAT_ADDR_MATCH         ((uint32_t)0x0000000EU)         /* !< 9-bit mode address match interrupt;
                                                                                    Interrupt Flag: ADDR_MATCH */
#define UNICOMMUART_IIDX_STAT_CTS                ((uint32_t)0x0000000FU)         /* !< UART Clear to Send Modem interrupt;
                                                                                    Interrupt Flag: CTS */
#define UNICOMMUART_IIDX_STAT_DMA_DONE_RX        ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define UNICOMMUART_IIDX_STAT_DMA_DONE_TX        ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define UNICOMMUART_IIDX_STAT_NERR_EVT           ((uint32_t)0x00000012U)         /* !< Noise Error Event */
#define UNICOMMUART_IIDX_STAT_DMA_PREIRQ_RX      ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define UNICOMMUART_IIDX_STAT_DMA_PREIRQ_TX      ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */
#define UNICOMMUART_IIDX_STAT_LTFG               ((uint32_t)0x00000015U)         /* !< UART line time-out interrupt;
                                                                                    Interrupt Flag */

