MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_CPU_INT_MIS Bits */
/* UNICOMMUART_CPU_INT_MIS[RTOUT] Bits */
#define UNICOMMUART_CPU_INT_MIS_RTOUT_OFS        (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_CPU_INT_MIS_RTOUT_MASK       ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_RTOUT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_RTOUT_SET        ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[FRMERR] Bits */
#define UNICOMMUART_CPU_INT_MIS_FRMERR_OFS       (1)                             /* !< FRMERR Offset */
#define UNICOMMUART_CPU_INT_MIS_FRMERR_MASK      ((uint32_t)0x00000002U)         /* !< Masked UART Framing Error
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_FRMERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_FRMERR_SET       ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[PARERR] Bits */
#define UNICOMMUART_CPU_INT_MIS_PARERR_OFS       (2)                             /* !< PARERR Offset */
#define UNICOMMUART_CPU_INT_MIS_PARERR_MASK      ((uint32_t)0x00000004U)         /* !< Masked UART Parity Error Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_PARERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_PARERR_SET       ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[BRKERR] Bits */
#define UNICOMMUART_CPU_INT_MIS_BRKERR_OFS       (3)                             /* !< BRKERR Offset */
#define UNICOMMUART_CPU_INT_MIS_BRKERR_MASK      ((uint32_t)0x00000008U)         /* !< Masked UART Break Error Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_BRKERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_BRKERR_SET       ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[OVRERR] Bits */
#define UNICOMMUART_CPU_INT_MIS_OVRERR_OFS       (4)                             /* !< OVRERR Offset */
#define UNICOMMUART_CPU_INT_MIS_OVRERR_MASK      ((uint32_t)0x00000010U)         /* !< Masked UART Receive Overrun Error
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_OVRERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_OVRERR_SET       ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[RXNE] Bits */
#define UNICOMMUART_CPU_INT_MIS_RXNE_OFS         (5)                             /* !< RXNE Offset */
#define UNICOMMUART_CPU_INT_MIS_RXNE_MASK        ((uint32_t)0x00000020U)         /* !< Masked Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_RXNE_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_RXNE_SET         ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[RXPE] Bits */
#define UNICOMMUART_CPU_INT_MIS_RXPE_OFS         (6)                             /* !< RXPE Offset */
#define UNICOMMUART_CPU_INT_MIS_RXPE_MASK        ((uint32_t)0x00000040U)         /* !< Masked Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_RXPE_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_RXPE_SET         ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[LINC0] Bits */
#define UNICOMMUART_CPU_INT_MIS_LINC0_OFS        (7)                             /* !< LINC0 Offset */
#define UNICOMMUART_CPU_INT_MIS_LINC0_MASK       ((uint32_t)0x00000080U)         /* !< Masked LIN Capture 0 / Match
                                                                                    Interrupt . */
#define UNICOMMUART_CPU_INT_MIS_LINC0_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_LINC0_SET        ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[LINC1] Bits */
#define UNICOMMUART_CPU_INT_MIS_LINC1_OFS        (8)                             /* !< LINC1 Offset */
#define UNICOMMUART_CPU_INT_MIS_LINC1_MASK       ((uint32_t)0x00000100U)         /* !< Masked LIN Capture 1 Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_LINC1_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_LINC1_SET        ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[LINOVF] Bits */
#define UNICOMMUART_CPU_INT_MIS_LINOVF_OFS       (9)                             /* !< LINOVF Offset */
#define UNICOMMUART_CPU_INT_MIS_LINOVF_MASK      ((uint32_t)0x00000200U)         /* !< Masked LIN Hardware Counter
                                                                                    Overflow Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_LINOVF_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_LINOVF_SET       ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[RXINT] Bits */
#define UNICOMMUART_CPU_INT_MIS_RXINT_OFS        (10)                            /* !< RXINT Offset */
#define UNICOMMUART_CPU_INT_MIS_RXINT_MASK       ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_RXINT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_RXINT_SET        ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[TXINT] Bits */
#define UNICOMMUART_CPU_INT_MIS_TXINT_OFS        (11)                            /* !< TXINT Offset */
#define UNICOMMUART_CPU_INT_MIS_TXINT_MASK       ((uint32_t)0x00000800U)         /* !< Masked UART Transmit Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_TXINT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_TXINT_SET        ((uint32_t)0x00000800U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[EOT] Bits */
#define UNICOMMUART_CPU_INT_MIS_EOT_OFS          (12)                            /* !< EOT Offset */
#define UNICOMMUART_CPU_INT_MIS_EOT_MASK         ((uint32_t)0x00001000U)         /* !< UART End of Transmission Interrupt
                                                                                    Indicates that the last bit of all
                                                                                    transmitted data and flags has left
                                                                                    the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define UNICOMMUART_CPU_INT_MIS_EOT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_EOT_SET          ((uint32_t)0x00001000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[ADDR_MATCH] Bits */
#define UNICOMMUART_CPU_INT_MIS_ADDR_MATCH_OFS   (13)                            /* !< ADDR_MATCH Offset */
#define UNICOMMUART_CPU_INT_MIS_ADDR_MATCH_MASK  ((uint32_t)0x00002000U)         /* !< Masked Address Match Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_ADDR_MATCH_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_ADDR_MATCH_SET   ((uint32_t)0x00002000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[CTS] Bits */
#define UNICOMMUART_CPU_INT_MIS_CTS_OFS          (14)                            /* !< CTS Offset */
#define UNICOMMUART_CPU_INT_MIS_CTS_MASK         ((uint32_t)0x00004000U)         /* !< Masked UART Clear to Send Modem
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_CTS_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_CTS_SET          ((uint32_t)0x00004000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_RX_OFS  (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Masked DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_RX_CLR  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_RX_SET  ((uint32_t)0x00008000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_TX_OFS  (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Masked DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_TX_CLR  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_DMA_DONE_TX_SET  ((uint32_t)0x00010000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[NERR] Bits */
#define UNICOMMUART_CPU_INT_MIS_NERR_OFS         (17)                            /* !< NERR Offset */
#define UNICOMMUART_CPU_INT_MIS_NERR_MASK        ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define UNICOMMUART_CPU_INT_MIS_NERR_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_NERR_SET         ((uint32_t)0x00020000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Masked DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Masked DMA Done PREIRQ on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_MIS[LTOUT] Bits */
#define UNICOMMUART_CPU_INT_MIS_LTOUT_OFS        (20)                            /* !< LTOUT Offset */
#define UNICOMMUART_CPU_INT_MIS_LTOUT_MASK       ((uint32_t)0x00100000U)         /* !< Masked UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_MIS_LTOUT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_MIS_LTOUT_SET        ((uint32_t)0x00100000U)         /* !< Interrupt occurred */

