MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_PDBGCTL Bits */
/* UNICOMMUART_PDBGCTL[FREE] Bits */
#define UNICOMMUART_PDBGCTL_FREE_OFS             (0)                             /* !< FREE Offset */
#define UNICOMMUART_PDBGCTL_FREE_MASK            ((uint32_t)0x00000001U)         /* !< Free run control */
#define UNICOMMUART_PDBGCTL_FREE_STOP            ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define UNICOMMUART_PDBGCTL_FREE_RUN             ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* UNICOMMUART_PDBGCTL[SOFT] Bits */
#define UNICOMMUART_PDBGCTL_SOFT_OFS             (1)                             /* !< SOFT Offset */
#define UNICOMMUART_PDBGCTL_SOFT_MASK            ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define UNICOMMUART_PDBGCTL_SOFT_DEPRECATED      ((uint32_t)0x00000000U)         /* !< Not supported */
#define UNICOMMUART_PDBGCTL_SOFT_DELAYED         ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* UNICOMMUART_INTCTL Bits */
/* UNICOMMUART_INTCTL[INTEVAL] Bits */
#define UNICOMMUART_INTCTL_INTEVAL_OFS           (0)                             /* !< INTEVAL Offset */
#define UNICOMMUART_INTCTL_INTEVAL_MASK          ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define UNICOMMUART_INTCTL_INTEVAL_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define UNICOMMUART_INTCTL_INTEVAL_EVAL          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* UNICOMMUART_CTL0 Bits */
/* UNICOMMUART_CTL0[ENABLE] Bits */
#define UNICOMMUART_CTL0_ENABLE_OFS              (0)                             /* !< ENABLE Offset */
#define UNICOMMUART_CTL0_ENABLE_MASK             ((uint32_t)0x00000001U)         /* !< UART Module Enable.  If the UART is
                                                                                    disabled in the middle of
                                                                                    transmission or reception, it
                                                                                    completes the current character
                                                                                    before stopping.  If the ENABLE bit
                                                                                    is not set, all registers can still
                                                                                    be accessed and up2025-09-30d. It is
                                                                                    recommended to setup and change the
                                                                                    UART operation mode with having the
                                                                                    ENABLE bit cleared to avoid
                                                                                    unpredictable behavior during the
                                                                                    setup or up2025-09-30. If disabled the UART
                                                                                    module will not send or receive any
                                                                                    data and the logic is held in reset
                                                                                    state. */
#define UNICOMMUART_CTL0_ENABLE_DISABLE          ((uint32_t)0x00000000U)         /* !< Disable Module */
#define UNICOMMUART_CTL0_ENABLE_ENABLE           ((uint32_t)0x00000001U)         /* !< Enable module */
/* UNICOMMUART_CTL0[HSE] Bits */
#define UNICOMMUART_CTL0_HSE_OFS                 (15)                            /* !< HSE Offset */
#define UNICOMMUART_CTL0_HSE_MASK                ((uint32_t)0x00018000U)         /* !< High-Speed Bit Oversampling Enable
                                                                                    #b#NOTE:#/b# The bit oversampling
                                                                                    influences the UART baud-rate
                                                                                    configuration.  The state of this bit
                                                                                    has no effect on clock generation in
                                                                                    ISO7816 smart card mode (the SMART
                                                                                    bit is set). */
#define UNICOMMUART_CTL0_HSE_OVS16               ((uint32_t)0x00000000U)         /* !< 16x oversampling. */
#define UNICOMMUART_CTL0_HSE_OVS8                ((uint32_t)0x00008000U)         /* !< 8x oversampling. */
#define UNICOMMUART_CTL0_HSE_OVS3                ((uint32_t)0x00010000U)         /* !< 3x oversampling. IrDA, Manchester
                                                                                    and DALI not supported when 3x
                                                                                    oversampling is enabled. */
/* UNICOMMUART_CTL0[LBE] Bits */
#define UNICOMMUART_CTL0_LBE_OFS                 (2)                             /* !< LBE Offset */
#define UNICOMMUART_CTL0_LBE_MASK                ((uint32_t)0x00000004U)         /* !< UART Loop Back Enable */
#define UNICOMMUART_CTL0_LBE_DISABLE             ((uint32_t)0x00000000U)         /* !< Normal operation. */
#define UNICOMMUART_CTL0_LBE_ENABLE              ((uint32_t)0x00000004U)         /* !< The UARTxTX path is fed through the
                                                                                    UARTxRX path internally. */
/* UNICOMMUART_CTL0[RXE] Bits */
#define UNICOMMUART_CTL0_RXE_OFS                 (3)                             /* !< RXE Offset */
#define UNICOMMUART_CTL0_RXE_MASK                ((uint32_t)0x00000008U)         /* !< UART Receive Enable  If the UART is
                                                                                    disabled in the middle of a receive,
                                                                                    it completes the current character
                                                                                    before stopping.   #b#NOTE:#/b# To
                                                                                    enable reception, the UARTEN bit must
                                                                                    be set. */
#define UNICOMMUART_CTL0_RXE_DISABLE             ((uint32_t)0x00000000U)         /* !< The receive section of the UART is
                                                                                    disabled. */
#define UNICOMMUART_CTL0_RXE_ENABLE              ((uint32_t)0x00000008U)         /* !< The receive section of the UART is
                                                                                    enabled. */
/* UNICOMMUART_CTL0[TXE] Bits */
#define UNICOMMUART_CTL0_TXE_OFS                 (4)                             /* !< TXE Offset */
#define UNICOMMUART_CTL0_TXE_MASK                ((uint32_t)0x00000010U)         /* !< UART Transmit Enable  If the UART
                                                                                    is disabled in the middle of a
                                                                                    transmission, it completes the
                                                                                    current character before stopping.
                                                                                    #b#NOTE:#/b# To enable transmission,
                                                                                    the UARTEN bit must be set. */
#define UNICOMMUART_CTL0_TXE_DISABLE             ((uint32_t)0x00000000U)         /* !< The transmit section of the UART is
                                                                                    disabled. The UARTxTXD pin of the
                                                                                    UART can be controlled by the TXD_CTL
                                                                                    bit when enabled. */
#define UNICOMMUART_CTL0_TXE_ENABLE              ((uint32_t)0x00000010U)         /* !< The transmit section of the UART is
                                                                                    enabled. */
/* UNICOMMUART_CTL0[RTS] Bits */
#define UNICOMMUART_CTL0_RTS_OFS                 (12)                            /* !< RTS Offset */
#define UNICOMMUART_CTL0_RTS_MASK                ((uint32_t)0x00001000U)         /* !< Request to Send    If RTSEN is set
                                                                                    the RTS output signals is controlled
                                                                                    by the hardware logic using the FIFO
                                                                                    fill level or buffer status.  If
                                                                                    RTSEN is cleared the RTS output is
                                                                                    controlled by the RTS bit. The bit is
                                                                                    the complement of the UART request to
                                                                                    send, RTS modem status output. */
#define UNICOMMUART_CTL0_RTS_CLR                 ((uint32_t)0x00000000U)         /* !< Signal not RTS */
#define UNICOMMUART_CTL0_RTS_SET                 ((uint32_t)0x00001000U)         /* !< Signal RTS */
/* UNICOMMUART_CTL0[RTSEN] Bits */
#define UNICOMMUART_CTL0_RTSEN_OFS               (13)                            /* !< RTSEN Offset */
#define UNICOMMUART_CTL0_RTSEN_MASK              ((uint32_t)0x00002000U)         /* !< Enable hardware controlled Request
                                                                                    to Send */
#define UNICOMMUART_CTL0_RTSEN_DISABLE           ((uint32_t)0x00000000U)         /* !< RTS hardware flow control is
                                                                                    disabled. */
#define UNICOMMUART_CTL0_RTSEN_ENABLE            ((uint32_t)0x00002000U)         /* !< RTS hardware flow control is
                                                                                    enabled. Data is only requested (by
                                                                                    asserting UARTxRTS) when the receive
                                                                                    FIFO/buffer has available entries. */
/* UNICOMMUART_CTL0[CTSEN] Bits */
#define UNICOMMUART_CTL0_CTSEN_OFS               (14)                            /* !< CTSEN Offset */
#define UNICOMMUART_CTL0_CTSEN_MASK              ((uint32_t)0x00004000U)         /* !< Enable Clear To Send */
#define UNICOMMUART_CTL0_CTSEN_DISABLE           ((uint32_t)0x00000000U)         /* !< CTS hardware flow control is
                                                                                    disabled. */
#define UNICOMMUART_CTL0_CTSEN_ENABLE            ((uint32_t)0x00004000U)         /* !< CTS hardware flow control is
                                                                                    enabled. Data is only transmitted
                                                                                    when the UARTxCTS signal is asserted. */
/* UNICOMMUART_CTL0[MENC] Bits */
#define UNICOMMUART_CTL0_MENC_OFS                (7)                             /* !< MENC Offset */
#define UNICOMMUART_CTL0_MENC_MASK               ((uint32_t)0x00000080U)         /* !< Manchester Encode enable */
#define UNICOMMUART_CTL0_MENC_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable Manchester Encoding */
#define UNICOMMUART_CTL0_MENC_ENABLE             ((uint32_t)0x00000080U)         /* !< Enable Manchester Encoding */
/* UNICOMMUART_CTL0[MODE] Bits */
#define UNICOMMUART_CTL0_MODE_OFS                (8)                             /* !< MODE Offset */
#define UNICOMMUART_CTL0_MODE_MASK               ((uint32_t)0x00000700U)         /* !< Set the communication mode and
                                                                                    protocol used. (Not defined settings
                                                                                    uses the default setting: 0) */
#define UNICOMMUART_CTL0_MODE_UART               ((uint32_t)0x00000000U)         /* !< Normal operation */
#define UNICOMMUART_CTL0_MODE_RS485              ((uint32_t)0x00000100U)         /* !< RS485 mode: UART needs to be IDLE
                                                                                    with receiving data for the in
                                                                                    EXTDIR_HOLD set time. EXTDIR_SETUP
                                                                                    defines the time the RTS line is set
                                                                                    to high before sending. When the
                                                                                    buffer is empty the RTS line is set
                                                                                    low again. A transmit will be delayed
                                                                                    as long the UART is receiving data. */
#define UNICOMMUART_CTL0_MODE_IDLELINE           ((uint32_t)0x00000200U)         /* !< The UART operates in IDLE Line Mode */
#define UNICOMMUART_CTL0_MODE_ADDR9BIT           ((uint32_t)0x00000300U)         /* !< The UART operates in 9 Bit Address
                                                                                    mode */
#define UNICOMMUART_CTL0_MODE_SMART              ((uint32_t)0x00000400U)         /* !< ISO7816 Smart Card Support  The
                                                                                    application must ensure that it sets
                                                                                    8-bit word length (WLEN set to 3h)
                                                                                    and even parity (PEN set to 1, EPS
                                                                                    set to 1, SPS set to 0) in UARTLCRH
                                                                                    when using ISO7816 mode. The value of
                                                                                    the STP2 bit in UARTLCRH is ignored
                                                                                    and the number of stop bits is forced
                                                                                    to 2. */
#define UNICOMMUART_CTL0_MODE_DALI               ((uint32_t)0x00000500U)         /* !< DALI Mode: */
/* UNICOMMUART_CTL0[TXD_OUT] Bits */
#define UNICOMMUART_CTL0_TXD_OUT_OFS             (6)                             /* !< TXD_OUT Offset */
#define UNICOMMUART_CTL0_TXD_OUT_MASK            ((uint32_t)0x00000040U)         /* !< TXD Pin Control Controls the TXD
                                                                                    pin when TXD_OUT_EN = 1 and TXE = 0. */
#define UNICOMMUART_CTL0_TXD_OUT_LOW             ((uint32_t)0x00000000U)         /* !< TXD pin is low */
#define UNICOMMUART_CTL0_TXD_OUT_HIGH            ((uint32_t)0x00000040U)         /* !< TXD pin is high */
/* UNICOMMUART_CTL0[TXD_OUT_EN] Bits */
#define UNICOMMUART_CTL0_TXD_OUT_EN_OFS          (5)                             /* !< TXD_OUT_EN Offset */
#define UNICOMMUART_CTL0_TXD_OUT_EN_MASK         ((uint32_t)0x00000020U)         /* !< TXD Pin Control Enable. When the
                                                                                    transmit section of the UART is
                                                                                    disabled (TXE = 0), the TXD pin can
                                                                                    be controlled by the TXD_OUT bit. */
#define UNICOMMUART_CTL0_TXD_OUT_EN_DISABLE      ((uint32_t)0x00000000U)         /* !< TXD pin can not be controlled by
                                                                                    TXD_OUT */
#define UNICOMMUART_CTL0_TXD_OUT_EN_ENABLE       ((uint32_t)0x00000020U)         /* !< TXD pin can be controlled by
                                                                                    TXD_OUT */
/* UNICOMMUART_CTL0[MAJVOTE] Bits */
#define UNICOMMUART_CTL0_MAJVOTE_OFS             (18)                            /* !< MAJVOTE Offset */
#define UNICOMMUART_CTL0_MAJVOTE_MASK            ((uint32_t)0x00040000U)         /* !< Majority Vote Enable   When
                                                                                    Majority Voting is enabled, the three
                                                                                    center bits are used to determine
                                                                                    received sample value. In case of
                                                                                    error (i.e. all 3 bits are not the
                                                                                    same), noise error is detected and
                                                                                    bits RIS.NERR and register
                                                                                    RXDATA.NERR are set.
                                                                                    Oversampling of 16 : bits 7, 8, 9 are
                                                                                    used      Oversampling of 8 : bits 3,
                                                                                    4, 5 are used Disabled : Single
                                                                                    sample value (center value) used */
#define UNICOMMUART_CTL0_MAJVOTE_DISABLE         ((uint32_t)0x00000000U)         /* !< Majority voting is disabled */
#define UNICOMMUART_CTL0_MAJVOTE_ENABLE          ((uint32_t)0x00040000U)         /* !< Majority voting is enabled */
/* UNICOMMUART_CTL0[MSBFIRST] Bits */
#define UNICOMMUART_CTL0_MSBFIRST_OFS            (19)                            /* !< MSBFIRST Offset */
#define UNICOMMUART_CTL0_MSBFIRST_MASK           ((uint32_t)0x00080000U)         /* !< Most Significant Bit First This bit
                                                                                    has effect both on the way protocol
                                                                                    byte is transmitted and received.
                                                                                    Notes: User needs to match the
                                                                                    protocol to the correct value of this
                                                                                    bit to send MSb or LSb first. The
                                                                                    hardware engine will send the byte
                                                                                    entirely based on this bit. */
#define UNICOMMUART_CTL0_MSBFIRST_DISABLE        ((uint32_t)0x00000000U)         /* !< Least significant bit is sent first
                                                                                    in the protocol packet */
#define UNICOMMUART_CTL0_MSBFIRST_ENABLE         ((uint32_t)0x00080000U)         /* !< Most significant bit is sent first
                                                                                    in the protocol packet */

